<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"be5656fc4355df9e5cbe5ff8494a08c4cb1f536c751c872284211696c396bc74","plan_job_ref":"Job Create terraform plan #44 at https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/16866095942","plan_out_hash":"7b0025f2a006e8c3d2a4a41f5d860aaa6afecf22b5a3f0aa914e0660ec3ec3a9","plan_hash":"9e5c9b89a426f25f8768302cd800b795e38ea083dcad310b7ac5fbf4105cd947","plan_text_format":"diff","version":"2.2.2"} -->
OpenTofu plan in __infrastructure__
With variables: `environment = "prd"`
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # azuread_application.client will be created
+   resource "azuread_application" "client" {
+       app_role_ids                = (known after apply)
+       client_id                   = (known after apply)
+       description                 = "Application to login to the Projectcoordinator application"
+       disabled_by_microsoft       = (known after apply)
+       display_name                = "Projectcoordinator-prd"
+       id                          = (known after apply)
+       logo_url                    = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       object_id                   = (known after apply)
+       owners                      = [
+           "b922cbd6-faf0-409e-8e8d-2a0334440228",
        ]
+       prevent_duplicate_names     = true
+       publisher_domain            = (known after apply)
+       sign_in_audience            = "AzureADMyOrg"
+       tags                        = (known after apply)
+       template_id                 = (known after apply)

+       feature_tags (known after apply)

+       password (known after apply)

+       required_resource_access {
+           resource_app_id = "************************************"

+           resource_access {
+               id   = (known after apply)
+               type = "Scope"
            }
        }

+       single_page_application {
+           redirect_uris = (known after apply)
        }
    }

  # azuread_service_principal.microsoft_graph will be created
+   resource "azuread_service_principal" "microsoft_graph" {
+       account_enabled             = true
+       app_role_ids                = (known after apply)
+       app_roles                   = (known after apply)
+       application_tenant_id       = (known after apply)
+       client_id                   = "************************************"
+       display_name                = (known after apply)
+       homepage_url                = (known after apply)
+       id                          = (known after apply)
+       logout_url                  = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       oauth2_permission_scopes    = (known after apply)
+       object_id                   = (known after apply)
+       redirect_uris               = (known after apply)
+       saml_metadata_url           = (known after apply)
+       service_principal_names     = (known after apply)
+       sign_in_audience            = (known after apply)
+       tags                        = (known after apply)
+       type                        = (known after apply)
+       use_existing                = true

+       feature_tags (known after apply)

+       features (known after apply)
    }

  # azurerm_resource_group.this will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "westeurope"
+       name     = "rg-ProjectCoordinator-prd"
    }

  # azurerm_static_web_app.this will be created
+   resource "azurerm_static_web_app" "this" {
+       api_key                            = (sensitive value)
+       configuration_file_changes_enabled = true
+       default_host_name                  = (known after apply)
+       id                                 = (known after apply)
+       location                           = "westeurope"
+       name                               = "stapp-ProjectCoordinator-prd"
+       preview_environments_enabled       = true
+       public_network_access_enabled      = true
+       resource_group_name                = "rg-ProjectCoordinator-prd"
+       sku_size                           = "Free"
+       sku_tier                           = "Free"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   static_web_app_api_key = (sensitive value)
```
</details>

:memo: Plan generated in [Create terraform plan #44](https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/16866095942)